app/controllers/annonces_controller.rb

  def index
    @annonces = Annonce.all
---
SELECT * FROM "annonces"

  def show
    @annonce = Annonce.find(params[:id])
---
SELECT * FROM "annonces" WHERE ("annonces"."id" = 1)

  def create
    @annonce = Annonce.new(params[:annonce])

    respond_to do |format|
      if @annonce.save
---
INSERT INTO "annonces" ("reference", "hebergement_id", "updated_at", "title", "is_validated", "description", "created_at") VALUES('', NULL, '2010-03-21 13:11:36', 'Annonce de test', 't', 'Voici le corps de l''annonce de test', '2010-03-21 13:11:36')