app/controllers/hebergements_controller.rb

SELECT * FROM "hebergements"
---
  def index
    @hebergements = Hebergement.all