app/controllers/offres_controller.rb

  def index
    @offres = Offre.all
---
SELECT * FROM "offres"

  def show
    @offre = Offre.find(params[:id])
---
SELECT * FROM "offres" WHERE ("offres"."id" = 1)

  def create
    @offre = Offre.new(params[:offre])

    respond_to do |format|
      if @offre.save
---
INSERT INTO "offres" ("name", "is_visible", "url_alias", "hebergement_id", "updated_at", "phone_contact", "type", "gmap_latitude", "website", "distance_commerce", "address_id", "user_id", "distance_train", "distance_transport", "gmap_longitude", "email", "created_at") VALUES('Jonathan Meiss', '', 'Meiss blog', NULL, '2010-03-25 16:42:35', '0610339598', NULL, '48.797887', 'www.meiss.fr', '3', NULL, NULL, '15', '1', '2.382428', 'jonathan@meiss.fr', '2010-03-25 16:42:35')